#Generated by Fabric Compiler ( version 2020.2-Lite <build 59895> ) at Sat Jun  3 19:57:13 2023

add_design "D:/VERILOG/flow_led/rtl/flow_led.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
add_constraint "D:/VERILOG/flow_led/prj/flow_led.fdc"
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
pnr 
pnr 
pnr 
pnr 
pnr 
pnr 
remove_constraint -force -logic -fdc "D:/VERILOG/flow_led/prj/flow_led.fdc"
add_constraint "D:/VERILOG/flow_led/prj/source/flow_led.fdc"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module flow_led
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_constraint  -logic -fdc "D:/VERILOG/smart_car/prj/source/flow_led.fdc"
add_constraint "D:/VERILOG/smart_car/prj/source/source/smart_car.fdc"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
remove_constraint  -logic -fdc "D:/VERILOG/smart_car/prj/source/flow_led.fdc"
add_constraint "D:/VERILOG/smart_car/prj/source/source/smart_car.fdc"
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
add_design "D:/VERILOG/smart_car/prj/source/rtl/smart_car.v"
remove_design -verilog "D:/VERILOG/smart_car/prj/source/rtl/smart_car.v"
add_design "D:/VERILOG/smart_car/prj/source/rtl/smart_car.v"
remove_design -verilog "D:/VERILOG/smart_car/prj/source/rtl/smart_car.v"
add_design "D:/VERILOG/smart_car/prj/source/rtl/smart_car.v"
remove_design -verilog "D:/VERILOG/smart_car/prj/source/rtl/smart_car.v"
add_design "D:/VERILOG/smart_car/prj/source/rtl/smart_car.v"
remove_design -verilog "D:/VERILOG/smart_car/prj/source/rtl/smart_car.v"
add_design "D:/VERILOG/smart_car/prj/source/rtl/smart_car.v"
remove_design -verilog "D:/VERILOG/smart_car/prj/source/rtl/smart_car.v"
add_design "D:/VERILOG/smart_car/prj/source/rtl/smart_car.v"
remove_design -verilog "D:/VERILOG/smart_car/prj/source/rtl/smart_car.v"
add_design "D:/VERILOG/smart_car/prj/source/rtl/smart_car.v"
remove_design -verilog "D:/VERILOG/smart_car/prj/source/rtl/smart_car.v"
add_design "D:/VERILOG/smart_car/prj/source/rtl/smart_car.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -verilog "D:/VERILOG/smart_car/rtl/flow_led.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
gen_bit_stream 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module smart_car
