/*******************************************************************
* 文件名称 : car.c
* 作       者 :
* 版       本 :
* 日       期 : 2023/7/19
* 描       述 : 此文件包含了小车的headers
*******************************************************************/

#include "car.h"

/********************************************************************
* 函数名称      : Car_Run
* 函数功能      : 小车停止
* 输       入      : 无
* 输       出      : 无
*********************************************************************/
void Car_Run()
{
    GPIO_WriteBit(GPIOE, GPIO_Pin_12, 0);       // 灯亮
    GPIO_WriteBit(GPIOD, GPIO_Pin_8, 1);
}



/********************************************************************
* 函数名称      : Car_Stop
* 函数功能      : 小车停止
* 输       入      : 无
* 输       出      : 无
*********************************************************************/
void Car_Stop()
{
    GPIO_WriteBit(GPIOE, GPIO_Pin_12, 1);       // 灯灭
    GPIO_WriteBit(GPIOD, GPIO_Pin_8, 0);
}



/********************************************************************
* 函数名称      : Car_Front_Run
* 函数功能      : 小车前进
* 输       入      : u32 ms           信号变化与小车运动间的延迟
* 输       出      : 无
*********************************************************************/
void Car_Front_Run(u32 ms)
{
    Car_Stop();
    Delay_Ms(ms);
    GPIO_WriteBit(GPIOE, GPIO_Pin_13, 0);
    GPIO_WriteBit(GPIOE, GPIO_Pin_14, 0);       // 00为前进信号
    Delay_Ms(ms);
    Car_Run();
}



/********************************************************************
* 函数名称      : Car_Back_Run
* 函数功能      : 小车后退
* 输       入      : u32 ms           信号变化与小车运动间的延迟
* 输       出      : 无
*********************************************************************/
void Car_Back_Run(u32 ms)
{
    Car_Stop();
    Delay_Ms(ms);
    GPIO_WriteBit(GPIOE, GPIO_Pin_13, 0);
    GPIO_WriteBit(GPIOE, GPIO_Pin_14, 1);       // 01为后退信号
    Delay_Ms(ms);
    Car_Run();
}



/********************************************************************
* 函数名称      : Car_Turn_Right
* 函数功能      : 小车原地右转
* 输       入      : u32 ms           信号变化与小车运动间的延迟
* 输       出      : 无
*********************************************************************/
void Car_Turn_Right(u32 ms)
{
    Car_Stop();
    Delay_Ms(ms);
    GPIO_WriteBit(GPIOE, GPIO_Pin_13, 1);
    GPIO_WriteBit(GPIOE, GPIO_Pin_14, 0);       // 10为右转信号
    Delay_Ms(ms);
    Car_Run();
}



/********************************************************************
* 函数名称      : Car_Turn_Left
* 函数功能      : 小车原地左转
* 输       入      : u32 ms           信号变化与小车运动间的延迟
* 输       出      : 无
*********************************************************************/
void Car_Turn_Left(u32 ms)
{
    Car_Stop();
    Delay_Ms(ms);
    GPIO_WriteBit(GPIOE, GPIO_Pin_13, 1);
    GPIO_WriteBit(GPIOE, GPIO_Pin_14, 1);       // 11为左转信号
    Delay_Ms(ms);
    Car_Run();
}



/********************************************************************
* 函数名称      : Echo_Switch
* 函数功能      : 小车原地左转
* 输       入      : u8 mode          超声波测距模块开关
* 输       出      : 无
*********************************************************************/
void Echo_Switch(u8 mode)
{
    GPIO_WriteBit(GPIOD, GPIO_Pin_9, mode);
}



/********************************************************************
* 函数名称      : Car_Control
* 函数功能      : 蓝牙控制小车
* 输       入      : char buffer              要发送的数据
* 输       出      : 无
*********************************************************************/
void Car_Control(char state)
{
    if (state == 'F')                     //接受前进信号时小车前进
    {
        Car_Front_Run(TURNDELAY);
    } else if (state == 'B')              //接受后退信号时小车后退
    {
        Car_Back_Run(TURNDELAY);
    } else if (state == 'L')              //接受左转信号时小车左转
    {
        Car_Turn_Left(TURNDELAY);
    } else if (state == 'R')              //接受右转信号时小车右转
    {
        Car_Turn_Right(TURNDELAY);
    } else if (state == 'S')              //接受停止信号时小车停止
    {
        Car_Stop();
    }
}



